app/Models/CustomModel.php

  function all(){
    return $this->db->table('posts')->get()->getResult();
---
SELECT *
FROM `posts`

  function where($post_id){
    return $this->db->table('posts')
                    ->where(['post_id >'=>$post_id])
                    ->where(['post_id <'=>$post_id+5])
                    ->where(['post_id !='=>$post_id+3])
                    ->orderBy('post_id','ACS')
                    ->get()
                    ->getResult();
---
SELECT *
FROM `posts`
WHERE `post_id` > '90'
AND `post_id` < 95
AND `post_id` != 93
ORDER BY `post_id` DESC

  function getPosts(){
    $builder=$this->db->table('posts');
    $builder->join('users','posts.post_author=users.user_id');
    $post=$builder->get()->getResult();
---
SELECT *
FROM `posts`
JOIN `users` ON `posts`.`post_author`=`users`.`user_id`